In [11]:
import pandas as pd

Converted txt to csv

In [12]:
df=pd.read_csv(r'C:\Users\shrad\Desktop\Data Science\PRWtech DS\Untitled Folder\Temperature.csv')

In [13]:
df.head()

   year  temp
0  1900    39
1  1900    14
2  1900     5
3  1900    11
4  1900    20

In [14]:
df.dtypes

year    int64
temp    int64
dtype: object

In [15]:
unique=df['year'].unique()

In [18]:
unique

array([1900, 1901, 1902, 1903, 1904, 1905, 1906, 1907, 1908, 1909, 1910,
       1911, 1912, 1913, 1914, 1915, 1916, 1917, 1918, 1919, 1920, 1921,
       1922, 1923, 1924, 1925, 1926, 1927, 1928, 1929, 1930, 1931, 1932,
       1933, 1934, 1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943,
       1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954,
       1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965,
       1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976,
       1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=int64)

In [19]:
df.describe()

              year         temp
count  1199.000000  1199.000000
mean   1957.679733    24.647206
std      32.467976    14.387256
min    1900.000000     0.000000
25%    1930.000000    12.000000
50%    1957.000000    25.000000
75%    1985.000000    37.000000
max    2013.000000    49.000000

In [21]:
a=df.groupby(['year'])["temp"].max()

In [27]:
a.head(50)

year
1900    46
1901    48
1902    49
1903    35
1904    46
1905    35
1906    32
1907    49
1908    44
1909    38
1910    47
1911    48
1912    44
1913    43
1914    49
1915    49
1916    18
1917    35
1918    49
1919    42
1920    47
1921    47
1922    45
1923    41
1924    49
1925    48
1926    49
1927    47
1928    48
1929    35
1930    48
1931    37
1932    33
1933    43
1934    47
1935    40
1936    48
1937    44
1938    43
1939    48
1940    49
1941    49
1942    24
1943    45
1944    39
1945    47
1946    48
1947    41
1948    42
1949    48
Name: temp, dtype: int64